spec/fake_responses/get_bonus_payments.xml

<?xml version="1.0"?>
<GetBonusPaymentsResponse><OperationRequest><RequestId>2851062f-f1a1-46b4-9aa0-268906aef381</RequestId></OperationRequest><GetBonusPaymentsResult><Request><IsValid>True</IsValid></Request><NumResults>3</NumResults><TotalNumResults>3</TotalNumResults><PageNumber>1</PageNumber><BonusPayment><WorkerId>AGDRU4D1VTQLB</WorkerId><BonusAmount><Amount>0.04</Amount><CurrencyCode>USD</CurrencyCode><FormattedPrice>$0.04</FormattedPrice></BonusAmount><AssignmentId>180E4LY5TVT3R8QIIGL8GNEZWCF0UF</AssignmentId><Reason>Congrats! You earned a $0.04 bonus!</Reason><GrantTime>2010-09-17T20:16:40Z</GrantTime></BonusPayment><BonusPayment><WorkerId>A2UMLFMF60AX21</WorkerId><BonusAmount><Amount>0.04</Amount><CurrencyCode>USD</CurrencyCode><FormattedPrice>$0.04</FormattedPrice></BonusAmount><AssignmentId>199HR1YM20ZMAFPXZF8OCEGRF8BHQT</AssignmentId><Reason>Congrats! You earned a $0.04 bonus!</Reason><GrantTime>2010-09-17T20:16:41Z</GrantTime></BonusPayment><BonusPayment><WorkerId>A3FUPDYEZ3Z67F</WorkerId><BonusAmount><Amount>0.04</Amount><CurrencyCode>USD</CurrencyCode><FormattedPrice>$0.04</FormattedPrice></BonusAmount><AssignmentId>10NJ8OOK1GQKTFA5UU0RQDWISW81GL</AssignmentId><Reason>Congrats! You earned a $0.04 bonus!</Reason><GrantTime>2010-09-17T20:16:41Z</GrantTime></BonusPayment></GetBonusPaymentsResult></GetBonusPaymentsResponse>
